In [1]:
import pandas as pd
import numpy as np

In [2]:
c1 = ["A"] + ["A", "B"] * 4
c2 = list(range(len(c1)))
df = pd.DataFrame({"c1": c1 ,
                  "c2": c2})

In [14]:
df.shift(2)

    c1   c2
0  NaN  NaN
1  NaN  NaN
2    A  0.0
3    A  1.0
4    B  2.0
5    A  3.0
6    B  4.0
7    A  5.0
8    B  6.0

In [16]:
df

  c1  c2
0  A   0
1  A   1
2  B   2
3  A   3
4  B   4
5  A   5
6  B   6
7  A   7
8  B   8

In [15]:
df.rolling(2).sum()

     c2
0   NaN
1   1.0
2   3.0
3   5.0
4   7.0
5   9.0
6  11.0
7  13.0
8  15.0

In [3]:
df.groupby("c1")["c2"].shift(2)

0    NaN
1    NaN
2    NaN
3    0.0
4    NaN
5    1.0
6    2.0
7    3.0
8    4.0
Name: c2, dtype: float64

In [19]:
df.rolling(window=2).sum()

     c2
0   NaN
1   1.0
2   3.0
3   5.0
4   7.0
5   9.0
6  11.0
7  13.0
8  15.0

In [22]:
def mean_exclude_last(x):
    return np.mean(x[:-1])

def rolling_mean(x):
    return x.rolling(2).apply(mean_exclude_last, raw=True)

In [23]:

df.groupby("c1")["c2"].transform(rolling_mean)

0    NaN
1    0.0
2    NaN
3    1.0
4    2.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: c2, dtype: float64

In [27]:
# exclude the last one when calculating a mean is equivalent do a mean on a w-1 size of window
# then shift the mean. 
# source: https://www.youtube.com/watch?v=T2mQiesnx8s (7:15)
df.groupby("c1")["c2"].transform(lambda x: x.rolling(1).mean().shift(1))

0    NaN
1    0.0
2    NaN
3    1.0
4    2.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: c2, dtype: float64

In [34]:
df.groupby("c1")["c2"].rolling(2).apply(mean_exclude_last, raw=True)

c1
A   0    NaN
    1    0.0
    3    1.0
    5    3.0
    7    5.0
B   2    NaN
    4    2.0
    6    4.0
    8    6.0
Name: c2, dtype: float64

In [35]:
df

  c1  c2
0  A   0
1  A   1
2  B   2
3  A   3
4  B   4
5  A   5
6  B   6
7  A   7
8  B   8